Revit 2026 API

# RebarConstraintHasAnEdgeNumber Method

---

Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasAnEdgeNumber()
```
```vb
Public Function HasAnEdgeNumber As Boolean
```
```cpp
public:
bool HasAnEdgeNumber()
```
```fsharp
member HasAnEdgeNumber : unit -> bool
```

#### Return Value

Boolean

The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the RebarTargetConstraintType must be 'Edge' or 'BarBend'.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace